Repository: HuyAms/Minida
Catalog: Project_Ios/*.lproj/Localizable.strings
Languages: fi

source: Error
fi: Virhe

source: Item name should not be empty
fi: Tuotteella täytyy olla nimi

source: Invalid category
fi: Virheellinen luokka

source: Invalid email
fi: Antamasi sähköpostiosoite on väärä.

source: Phone number must have 10 numbers
fi: Puhelinnumerossa täytyy olla 10 numeroa.

source: You do not have permission to edit this item
fi: Sinulla ei ole oikeuksia muokata tätä tuotetta.

source: This item has not beet deleted
fi: Tämä tuote on myyty

source: You cannot buy your own item
fi: Et voi ostaa omaa tuotettasi

source: Could not request point
fi: Pisteitä ei voitu hakea

source: You do not have enough points to buy this item
fi: Sinulla ei ole tarpeeksi pisteitä ostaaksesi tämän tuotteen.

source: This username has already been used
fi: Käyttäjätunnus on jo olemassa

source: This email has already been used
fi: Sähköpostiosoite on jo olemassa

source: This phone number has already been used
fi: Puhelinnumero on jo olemassa

source: Username does not exist
fi: Käyttäjätunnusta ei ole olemassa

source: Password is not correct
fi: Antamasi salasana on väärä

source: No internet connection
fi: Ei internet-yhteyttä

source: Item has been deleted
fi: Tuote on poistettu

source: There was a problem verifying your identity.
fi: Identiteetin vahvistuksessa oli ongelma.

source: You pressed cancel
fi: Painoit peruuta.

source: You pressed password.
fi: Painoit salasanaa.

source: Face ID/ Touch ID is not available
fi: FaceID / TouchID ei ole saatavilla.

source: Face ID/ Touch ID is not set up
fi: Face ID / Touch ID ei ole alustettu.

source: Face ID/ Touch ID is locked
fi: Face ID / Touch ID on lukittu.

source: Face ID/ Touch ID may not be configured
fi: Face ID / Touch ID asetuksia ei ole säädetty.

source: Field should not be empty
fi: Tämä kenttä on pakollinen.

source: This voucher is not available
fi: Tätä kuponkia ei ole saatavilla.

source: Unknown error
fi: Tuntematon virhe.

source: clothing
fi: vaatteet

source: devices
fi: laitteet

source: accessories
fi: korut

source: homewares
fi: kodintavarat

source: vehicles
fi: kulkuvälineet

source: others
fi: muut

source: Clothing
fi: Vaatteet

source: Devices
fi: Laitteet

source: Accessories
fi: Korut

source: Homewares
fi: Kodintavarat

source: Vehicles
fi: Kulkuvälineet

source: Others
fi: Muut

source: Free
fi: Ilmaiset

source: Mercury
fi: Merkurius

source: Earth
fi: Maa

source: Neptune
fi: Neptunus

source: Saturn
fi: Saturnus

source: Home
fi: Koti

source: Map
fi: Kartta

source: Post
fi: Lisää tuote

source: Notification
fi: Ilmoitukset

source: Profile
fi: Profiili

source: Choose Photo
fi: Valitse kuva

source: Take Photo
fi: Ota kuva

source: Cancel
fi: Peruuta

source: Yes
fi: Kyllä

source: Success
fi: Hyväksytty

source: Great!
fi: Hyvä!

source: Oops!
fi: Hups!

source: SIGN UP
fi: Rekisteröidy

source: Already have an account?
fi: Onko sinulla jo tili?

source: SIGN IN
fi: Kirjaudu sisään

source: Don't have an account?
fi: Eikö sinulla ole tiliä?

source: Username
fi: Käyttäjätunnus

source: Password
fi: Salasana

source: Email
fi: Sähköposti

source: Phone Number
fi: Puhelinnumero

source: Sign in with another account
fi: Kirjaudu toisella käyttäjällä

source: Confirm
fi: Vahvista

source: No such item found
fi: Ei hakutuloksia

source: Search Items
fi: Haku

source: Buy
fi: Osta

source: Badge
fi: Taso

source: Time:
fi: Päivä:

source: FREE
fi: Ilmainen

source: Do you want to delete this item?
fi: Haluatko poistaa tämän tuotteen?

source: Delete item successfully
fi: Tuote poistettu

source: Delete
fi: Poista

source: Do you want to buy this item?
fi: Haluatko ostaa tämän tuotteen?

source: Name
fi: Nimi

source: Description
fi: Kuvaus

source: Price
fi: Hinta

source: Category
fi: Kategoria

source: Choose Category
fi: Valitse kategoria

source: Recycling Center
fi: Kierrätyskeskukset

source: Direction
fi: Suunta

source: Open Apple Maps to get direction
fi: Avaa Apple Kartat saadaksesi reitin

source: You have no notifications
fi: Ei ilmoituksia

source: You have bought %@ from %@
fi: Olet ostanut tuotteen %@ käyttäjältä %@

source: You have sold %@ to %@
fi: Olet myynyt tuotteen %@ käyttäjälle %@

source: Log out
fi: Kirjaudu ulos

source: Are you sure you want to log out?
fi: Haluatko varmasti kirjautua ulos?

source: This user has no items on sale
fi: Tällä käyttäjällä ei ole tuotteita myynnissä

source: You have no items on sale
fi: Sinulla ei ole tuotteita myynnissä

source: You have not bought any item yet
fi: Et ole ostanut vielä mitään tuotteita

source: You have not sold any item yet
fi: Et ole myynyt vielä mitään tuotteita

source: Add Point
fi: Osta pisteitä

source: Points
fi: Pisteet

source: Recycles
fi: Kierrätykset

source: Edit Profile
fi: Muokkaa profiilia

source: Leaderboard
fi: Pistetilasto

source: On Sale
fi: Myynnissä

source: Sold
fi: Myydyt

source: Bought
fi: Ostetut

source: Top 10
fi: 10 Parasta

source: %d recycled items
fi: %d kierrätettyä tuotetta

source: Mars badge = %d recycles
fi: Mars = %d kierrätystä

source: Mercury badge = %d recycles
fi: Merkurius = %d kierrätystä

source: Venus badge = %d recycles
fi: Venus = %d kierrätystä

source: Earth badge = %d recycles
fi: Maa = %d kierrätystä

source: Neptune badge = %d recycles
fi: Neptunus = %d kierrätystä

source: Uranus badge = %d recycles
fi: Uranus = %d kierrätystä

source: Saturn badge = %d recycles
fi: Saturnus = %d kierrätystä

source: Jupiter badge = %d recycles
fi: Jupiter = %d kierrätystä

source: Voucher
fi: Kupongit

source: All
fi: Kaikki

source: My Voucher
fi: Omat

source: Exchange
fi: Osta

source: %d points
fi: %d pistettä

source: Buy voucher successfully
fi: Kuponki ostettu

source: Payment
fi: Osto

source: This voucher costs you %d points
fi: Tämä kuponki maksaa sinulle %d pistettä

source: Point Purchase
fi: Osta pisteitä

source: Name:
fi: Nimi:

source: Point:
fi: Pisteet:

source: Please select your payment method
fi: Valitse maksutapa

source: Add Card
fi: Lisää maksukortti

source: Add
fi: Osta

source: Add %d points
fi: %d pistettä

source: Pay Now
fi: Hyväksy maksu

source: %d points cost you %d €
fi: %d pistettä maksaa sinulle %d €

source: You now have %d points
fi: Sinulla on nyt %d pistettä

source: Receipt
fi: Kuitti

source: Price:
fi: Hinta:

source: Seller:
fi: Myyjä:

source: Badge:
fi: Taso:

source: Contact
fi: Ota yhteyttä

source: How do you want to contact?
fi: Kuinka haluat ottaa yhteyttä?

source: Edit Name
fi: Muokkaa Nimeä

source: Edit Email
fi: Muokkaa Sähköpostia

source: Edit Phone
fi: Muokkaa Numeroa

source: Item Name
fi: Tuotteen nimi

source: Welcome to Minida!
fi: Tervetuloa Minidaan!

source: Minida is an online marketplace for second-hand items. Sell them to other users or donate to a recycling center near you!
fi: Minida on kauppapaikka käytetyille tuotteille. Voit myydä tuotteita muille käyttäjille tai lahjoittaa tuotteita kierrätyskeskukseen.

source: Acquire Points
fi: Saa pisteitä

source: All purchases are done with points. Get points by selling and donating items, or buy them with a paycard.
fi: Kaikki ostokset tehdään pisteiden avulla. Saat pisteitä myymällä tuotteitasi. Voit myös ostaa pisteitä pankkikortilla.

source: Enjoy the selection!
fi: Nauti valikoimasta!

source: The users of Minida offer a wide variety of items and vouchers to choose from!
fi: Minidan käyttäjillä on monenlaisia tuotteita tarjolla. Tee löytöjä!

source: Let's Get Started!
fi: Aloitetaan!
